cnlohr/ch32v003fun/minichlink/minichlink.c
		case FLASH_128_RAM_64:
			if (chip == 0x2034050c
			 || chip == 0x2080050c
			 || chip == 0x2081050c
			 || chip == 0x2082050c
			 || chip == 0x2083050c) {
				split_code = 0;
			} else {
				fprintf( stderr, "Error, 128k/64k split not supported for chip 0x%08x\n", chip);
				exit( -110 );
			}
			break;

		case FLASH_144_RAM_48:
			if (chip == 0x2034050c
			 || chip == 0x2080050c
			 || chip == 0x2081050c
			 || chip == 0x2082050c
			 || chip == 0x2083050c) {
				split_code = 1;
			} else {
				fprintf( stderr, "Error, 144k/48k split not supported for chip 0x%08x\n", chip);
				exit( -110 );
			}
			break;

		case FLASH_160_RAM_32:
			if (chip == 0x2034050c
			 || chip == 0x2080050c
			 || chip == 0x2081050c
			 || chip == 0x2082050c
			 || chip == 0x2083050c) {
				split_code = 2;
			} else {
				fprintf( stderr, "Error, 160k/32k split not supported for chip 0x%08x\n", chip);
				exit( -110 );
			}
			break;

		default:
			fprintf( stderr, "Error: chip 0x%08x does not support a configurable RAM split\n", chip);
			return -110;
			
	}

	if( !MCF.WriteHalfWord || !MCF.ReadHalfWord)
	{
		fprintf( stderr, "Error: for setting ram split option bytes, half-word read and write is required\n" );
		return -5;
	}

	if( MCF.ReadHalfWord( dev, (intptr_t)&OB->USER, &option_bytes ) ) goto flashoperr;
	printf("initial option_bytes = %04x\n", option_bytes);


	// Option byte b is stored as 16 bits (~b << 8)|b
	// Mask off upper copy and clear split bits
	option_bytes &= 0x003F;
	// Set split code at [7:6]
	option_bytes |= split_code << 6;
	// Add inverted copy back as high byte
	option_bytes |= (~option_bytes) << 8;

	InternalUnlockFlash(dev, iss);

	if( MCF.ReadWord( dev, (intptr_t)&FLASH->CTLR, &flash_ctlr ) ) goto flashoperr;
	flash_ctlr |= CR_OPTER_Set;
	if( MCF.WriteWord( dev, (intptr_t)&FLASH->CTLR, flash_ctlr ) ) goto flashoperr;
	flash_ctlr |= CR_STRT_Set;
	if( MCF.WriteWord( dev, (intptr_t)&FLASH->CTLR, flash_ctlr ) ) goto flashoperr;
	if( MCF.WaitForFlash(dev) ) goto flashoperr;

	if( MCF.ReadWord( dev, (intptr_t)&FLASH->CTLR, &flash_ctlr ) ) goto flashoperr;
	flash_ctlr &= CR_OPTER_Reset;
	flash_ctlr |= CR_OPTPG_Set;
	if( MCF.WriteWord( dev, (intptr_t)&FLASH->CTLR, flash_ctlr ) ) goto flashoperr;
	if( MCF.WriteWord( dev, (intptr_t)&OB->RDPR, RDP_Key ) ) goto flashoperr;
	if( MCF.WaitForFlash(dev) ) goto flashoperr;

	if( MCF.WriteWord( dev, (intptr_t)&FLASH->OBKEYR, FLASH_KEY1 ) ) goto flashoperr;
	if( MCF.WriteWord( dev, (intptr_t)&FLASH->OBKEYR, FLASH_KEY2 ) ) goto flashoperr;
	if( MCF.WaitForFlash(dev) ) goto flashoperr;

	if( MCF.ReadWord( dev, (intptr_t)&FLASH->CTLR, &flash_ctlr ) ) goto flashoperr;
	flash_ctlr |= CR_OPTPG_Set;
	if( MCF.WriteWord( dev, (intptr_t)&FLASH->CTLR, flash_ctlr ) ) goto flashoperr;
	if( MCF.WriteHalfWord( dev, (intptr_t)&OB->USER, option_bytes ) ) goto flashoperr;
	if( MCF.WaitForFlash(dev) ) goto flashoperr;

	flash_ctlr &= CR_OPTPG_Reset;
	if( MCF.WriteWord( dev, (intptr_t)&FLASH->CTLR, flash_ctlr ) ) goto flashoperr;
	if( MCF.WaitForFlash(dev) ) goto flashoperr;

	return 0;
flashoperr:
	fprintf( stderr, "Error: Flash operation error\n" );
	return -93;
}

void PostSetupConfigureInterface( void * dev )
{
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	switch( iss->target_chip_type )
	{
	case CHIP_CH32V10x:
	case CHIP_CH57x:
	case CHIP_CH56x:
	case CHIP_CH32V20x:
	case CHIP_CH32V30x:
	case CHIP_CH58x:
	default:
		iss->nr_registers_for_debug = 32;
		break;
	case CHIP_CH32V003:
		iss->nr_registers_for_debug = 16;
		break;
	}
}

int DefaultReadBinaryBlob( void * dev, uint32_t address_to_read_from, uint32_t read_size, uint8_t * blob )
{
	uint32_t rpos = address_to_read_from;
	uint32_t rend = address_to_read_from + read_size;

	while( rpos < rend )
	{
		int r;
		int remain = rend - rpos;

		if( ( rpos & 3 ) == 0 && remain >= 4 )
		{
			uint32_t rw;
			r = MCF.ReadWord( dev, rpos, &rw );
			//printf( "RW: %d %08x %08x\n", r, rpos, rw );
			if( r ) return r;
			int rem = remain;
			if( rem > 4 ) rem = 4;
			memcpy( blob, &rw, rem);
			blob += 4;
			rpos += 4;
		}
		else
		{
			if( ( rpos & 1 ) )
			{
				uint8_t rw;
				r = MCF.ReadByte( dev, rpos, &rw );
				if( r ) return r;
				memcpy( blob, &rw, 1 );
				blob += 1;
				rpos += 1;
				remain -= 1;
			}
			if( ( rpos & 2 ) && remain >= 2 )
			{
				uint16_t rw;
				r = MCF.ReadHalfWord( dev, rpos, &rw );
				if( r ) return r;
				memcpy( blob, &rw, 2 );
				blob += 2;
				rpos += 2;
				remain -= 2;
			}
			if( remain >= 1 )
			{
				uint8_t rw;
				r = MCF.ReadByte( dev, rpos, &rw );
				if( r ) return r;
				memcpy( blob, &rw, 1 );
				blob += 1;
				rpos += 1;
				remain -= 1;
			}
		}
	}
	int r = MCF.WaitForDoneOp( dev, 0 );
	if( r ) fprintf( stderr, "Fault on DefaultReadBinaryBlob\n" );
	return r;
}

int DefaultReadCPURegister( void * dev, uint32_t regno, uint32_t * regret )
{
	if( !MCF.WriteReg32 || !MCF.ReadReg32 )
	{
		fprintf( stderr, "Error: Can't read CPU register on this programmer because it is missing read/writereg32\n" );
		return -5;
	}

	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	MCF.WriteReg32( dev, DMABSTRACTAUTO, 0x00000000 ); // Disable Autoexec.
	iss->statetag = STTAG( "REGR" );

	MCF.WriteReg32( dev, DMCOMMAND, 0x00220000 | regno ); // Read xN into DATA0.
	int r = MCF.ReadReg32( dev, DMDATA0, regret );

	return r;
}

int DefaultReadAllCPURegisters( void * dev, uint32_t * regret )
{
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	MCF.WriteReg32( dev, DMABSTRACTAUTO, 0x00000001 ); // Disable Autoexec.
	iss->statetag = STTAG( "RER2" );
	int i;
	for( i = 0; i < iss->nr_registers_for_debug; i++ )
	{
		MCF.WriteReg32( dev, DMCOMMAND, 0x00220000 | 0x1000 | i ); // Read xN into DATA0.
		if( MCF.ReadReg32( dev, DMDATA0, regret + i ) )
		{
			MCF.WriteReg32( dev, DMABSTRACTAUTO, 0x00000000 ); // Disable Autoexec.
			return -5;
		}
	}
	MCF.WriteReg32( dev, DMCOMMAND, 0x00220000 | 0x7b1 ); // Read xN into DATA0.
	int r = MCF.ReadReg32( dev, DMDATA0, regret + i );
	MCF.WriteReg32( dev, DMABSTRACTAUTO, 0x00000000 ); // Disable Autoexec.
	return r;
}

int DefaultWriteAllCPURegisters( void * dev, uint32_t * regret )
{
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	MCF.WriteReg32( dev, DMABSTRACTAUTO, 0x00000001 ); // Disable Autoexec.
	iss->statetag = STTAG( "WER2" );
	int i;
	for( i = 0; i < iss->nr_registers_for_debug; i++ )
	{
		MCF.WriteReg32( dev, DMCOMMAND, 0x00230000 | 0x1000 | i ); // Read xN into DATA0.
		if( MCF.WriteReg32( dev, DMDATA0, regret[i] ) )
		{
			MCF.WriteReg32( dev, DMABSTRACTAUTO, 0x00000000 ); // Disable Autoexec.
			return -5;
		}
	}
	MCF.WriteReg32( dev, DMCOMMAND, 0x00230000 | 0x7b1 ); // Read xN into DATA0.
	int r = MCF.WriteReg32( dev, DMDATA0, regret[i] );
	MCF.WriteReg32( dev, DMABSTRACTAUTO, 0x00000000 ); // Disable Autoexec.
	return r;
}


